testCases/burnTest/burn1/constant/thermo.compressibleGas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.compressibleGas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Energetic Material Gas Definition
EMg
{
    specie
    {
        nMoles          1;
        molWeight       34.2;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 1400 0.0 0.0 0.0 0.0
                          3018000.0
                          0.0 );
        lowCpCoeffs     ( 1400 0.0 0.0 0.0 0.0
                          3018000.0
                          0.0 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

EMp
{
    specie
    {
        nMoles          1;
        molWeight       34.2;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 1400 0.0 0.0 0.0 0.0
                          0.0
                          0.0 );
        lowCpCoeffs     ( 1400 0.0 0.0 0.0 0.0
                          0.0
                          0.0 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

// Energetic Material Solid Placeholder
EMs
{
    specie
    {
        nMoles          1;
        molWeight       34.2;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 1400 0.0 0.0 0.0 0.0
                          0.0
                          0.0 );
        lowCpCoeffs     ( 1400 0.0 0.0 0.0 0.0
                          0.0
                          0.0 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}


// ************************************************************************* //
